ГТС/УТГТС/InformationRegisters/сег_СегментацияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>сег_СегментацияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отгружается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для реализации товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыКлиентом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСКлиентами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/сег_ПоказателиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>сег_ПоказателиСегментов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/CommonModules/сег_Сегментация/Ext/Module.bsl
Функция ПолучитьДанныеПоПартнеруЗапросом(пПериод, пЧислоМесяцев, пПартнер)

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	лТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	сег_СегментацияКонтрагентовСрезПоследних.Партнер КАК Партнер,
	|	сег_СегментацияКонтрагентовСрезПоследних.Подразделение
	|ПОМЕСТИТЬ втПартнеры
	|ИЗ
	|	РегистрСведений.сег_СегментацияКонтрагентов.СрезПоследних(&КонецПериода, ) КАК сег_СегментацияКонтрагентовСрезПоследних
	|ГДЕ
	|	сег_СегментацияКонтрагентовСрезПоследних.Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Объект КАК Заказ,
	|	ОбъектыРасчетов.Партнер КАК Партнер,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	СУММА(РасчетыСКлиентами.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСКлиентами.Период >= &НачалаПериода
	|				ТОГДА РасчетыСКлиентами.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаЗаГод
	|ПОМЕСТИТЬ втОплаченныеЗаказы
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО ОбъектыРасчетов.Объект = ЗаказКлиентаДок.Ссылка
	|ГДЕ
	|	РасчетыСКлиентами.ВидДвижения = &ВидДвижения
	|	И РасчетыСКлиентами.Регистратор <> ЗаказКлиентаДок.Ссылка
	|	И ОбъектыРасчетов.Партнер = &Партнер
	|	И РасчетыСКлиентами.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыРасчетов.Объект,
	|	ОбъектыРасчетов.Партнер,
	|	ОбъектыРасчетов.Организация,
	|	ОбъектыРасчетов.Подразделение,
	|	РасчетыСКлиентами.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Организация,
	|	""Вся фирма"" КАК Подразделение,
	|	МИНИМУМ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата) КАК ПерваяДатаЗаказа,
	|	МАКСИМУМ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата) КАК ПоследняяДатаЗаказа,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ) КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата >= &НачалаПериода
	|				ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЗаказовВГод,
	|	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СуммаЗаГод) КАК СуммаЗаГод
	|ИЗ
	|	втОплаченныеЗаказы КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер = &Партнер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Организация,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Организация,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Подразделение,
	|	МИНИМУМ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата),
	|	МАКСИМУМ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата >= &НачалаПериода
	|				ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	|			ИНАЧЕ NULL
	|		КОНЕЦ),
	|	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма),
	|	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СуммаЗаГод)
	|ИЗ
	|	втОплаченныеЗаказы КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер = &Партнер
	|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Подразделение В
	|			(ВЫБРАТЬ
	|				втПартнеры.Подразделение
	|			ИЗ
	|				втПартнеры КАК втПартнеры)
	|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Организация,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Подразделение,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Партнер";

	Запрос.УстановитьПараметр("Партнер", пПартнер);
	Запрос.Текст = лТекст;
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("КонецПериода", пПериод);
	Запрос.УстановитьПараметр("НачалаПериода", ДобавитьМесяц(пПериод, пЧислоМесяцев));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СоздатьОтчетПоСегментации(пПартнер) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	лТекДата = ТекущаяДата();
	тзПартнер = ПолучитьДанныеПоПартнеруЗапросом(лТекДата, -12, пПартнер);
	
	Возврат тзПартнер;
	
КонецФункции

Функция ЗапуститьОбработкуДилеровЗапросом()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	НЕ Партнеры.сег_Дилер В (ЗНАЧЕНИЕ(Справочник.сег_Сегменты.Дилер), ЗНАЧЕНИЕ(Справочник.сег_Сегменты.НеДилер))";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьОрганизацииЗапросом()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьПодразделенияЗапросом(МассивПодразделений=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	сег_ПоказателиСегментов.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.сег_ПоказателиСегментов КАК сег_ПоказателиСегментов
	|ГДЕ
	|	&УсловиеОтбора";
	
	
	Если МассивПодразделений=Неопределено Тогда
		Запрос.УстановитьПараметр("УсловиеОтбора",Истина);
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеОтбора"," Подразделение В (&МассивПодразделений) ");
		Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗапуститьОбработкуДилеров() Экспорт
	
	тзДилеры = ЗапуститьОбработкуДилеровЗапросом();
	Для Каждого Элемент Из тзДилеры Цикл
		лПартнер = Элемент.Значение.ПолучитьОбъект();
		лПартнер.сег_Дилер = Справочники.сег_Сегменты.НеДилер;
		лПартнер.ОбменДанными.Загрузка = Истина;
		лПартнер.Записать();
	КонецЦикла;
	
КонецФункции

// Новый запрос для функции ПолучитьОбработкуЗаказовЗапросом
// CommonModule.сег_Сегментация
// Работает после перехода на онлайн-взаиморасчеты:
//   - УдалитьЗаказКлиента заменен на ОбъектРасчетов + Справочник.ОбъектыРасчетов.
//   - Заказ определяется через ОбъектыРасчетов.Объект = Документ.ЗаказКлиента.Ссылка.

Функция ПолучитьОбработкуЗаказовЗапросом(пПериод, пЧислоМесяцев, пПодразделения = Неопределено, пПартнер = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	лТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партнеры.Ссылка КАК Партнер,
	|	Партнеры.сег_Дилер
	|ПОМЕСТИТЬ втПартнеры
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО Контрагенты.Партнер = Партнеры.Ссылка
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|ГДЕ
	|	НЕ Партнеры.ПометкаУдаления
	|	И Партнеры.Ссылка = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаДок.Ссылка КАК Заказ,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.Период >= &НачалаПериода
	|			ТОГДА ЗаказКлиентаДок.Ссылка
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ЗаказовЗаГод,
	|	ЗаказКлиентаДок.Партнер КАК Партнер,
	|	ЗаказКлиентаДок.Подразделение КАК Подразделение,
	|	РасчетыСКлиентами.Сумма,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.Период >= &НачалаПериода
	|			ТОГДА РасчетыСКлиентами.Сумма
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК СуммаЗаГод,
	|	ЗаказКлиентаДок.Дата КАК ЗаказДата
	|ПОМЕСТИТЬ втОплаченныеЗаказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПартнеры КАК втПартнеры
	|		ПО ЗаказКлиентаДок.Партнер = втПартнеры.Партнер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ЗаказКлиентаДок.Ссылка = ОбъектыРасчетов.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|ГДЕ
	|	РасчетыСКлиентами.ВидДвижения = &ВидДвижения
	|	И РасчетыСКлиентами.Регистратор <> ЗаказКлиентаДок.Ссылка
	|	И НЕ ЗаказКлиентаДок.Контрагент ЕСТЬ NULL 
	|	И РасчетыСКлиентами.Период <= &КонецПериода
	|	И ЗаказКлиентаДок.Партнер В
	|			(ВЫБРАТЬ
	|				втПартнеры.Партнер
	|			ИЗ
	|				втПартнеры КАК втПартнеры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаДок.Ссылка,
	|	РасчетыСКлиентами.Сумма,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.Период >= &НачалаПериода
	|			ТОГДА ЗаказКлиентаДок.Ссылка
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.Период >= &НачалаПериода
	|			ТОГДА РасчетыСКлиентами.Сумма
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ЗаказКлиентаДок.Партнер,
	|	ЗаказКлиентаДок.Подразделение,
	|	ЗаказКлиентаДок.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОплаченныеЗаказы.Партнер,
	|	втОплаченныеЗаказы.Подразделение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОплаченныеЗаказы.Заказ) КАК Заказ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втОплаченныеЗаказы.ЗаказДата >= &НачалаПериода
	|				ТОГДА втОплаченныеЗаказы.ЗаказДата
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ДатаПоследнегоЗаказа,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА втОплаченныеЗаказы.ЗаказДата >= &НачалаПериода
	|				ТОГДА втОплаченныеЗаказы.ЗаказДата
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ДатаПервогоЗаказа,
	|	СУММА(втОплаченныеЗаказы.Сумма) КАК Сумма,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОплаченныеЗаказы.ЗаказовЗаГод) КАК ЗаказовЗаГод,
	|	СУММА(втОплаченныеЗаказы.СуммаЗаГод) КАК СуммаЗаГод,
	|	втПартнеры.сег_Дилер КАК сег_Дилер
	|ИЗ
	|	втОплаченныеЗаказы КАК втОплаченныеЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПартнеры КАК втПартнеры
	|		ПО втОплаченныеЗаказы.Партнер = втПартнеры.Партнер
	|ГДЕ
	|	втОплаченныеЗаказы.Подразделение В(&Подразделение)
	|	И втОплаченныеЗаказы.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОплаченныеЗаказы.Подразделение,
	|	втОплаченныеЗаказы.Партнер,
	|	втПартнеры.сег_Дилер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОплаченныеЗаказы.Партнер,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОплаченныеЗаказы.Заказ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втОплаченныеЗаказы.ЗаказДата >= &НачалаПериода
	|				ТОГДА втОплаченныеЗаказы.ЗаказДата
	|			ИНАЧЕ NULL
	|		КОНЕЦ),
	|	МИНИМУМ(ВЫБОР
	|			КОГДА втОплаченныеЗаказы.ЗаказДата >= &НачалаПериода
	|				ТОГДА втОплаченныеЗаказы.ЗаказДата
	|			ИНАЧЕ NULL
	|		КОНЕЦ),
	|	СУММА(втОплаченныеЗаказы.Сумма),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втОплаченныеЗаказы.ЗаказовЗаГод),
	|	СУММА(втОплаченныеЗаказы.СуммаЗаГод),
	|	втПартнеры.сег_Дилер
	|ИЗ
	|	втОплаченныеЗаказы КАК втОплаченныеЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПартнеры КАК втПартнеры
	|		ПО втОплаченныеЗаказы.Партнер = втПартнеры.Партнер
	//|ГДЕ
	//|	втОплаченныеЗаказы.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОплаченныеЗаказы.Партнер,
	|	втПартнеры.сег_Дилер";	
	
	Если НЕ ЗначениеЗаполнено(пПартнер) Тогда
		лТекст = СтрЗаменить(лТекст, "И Партнеры.Ссылка = &Партнер", "");
	Иначе
		Запрос.УстановитьПараметр("Партнер", пПартнер);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Подразделение", пПодразделения);
	
	Запрос.Текст = лТекст;
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("КонецПериода", пПериод);
	Запрос.УстановитьПараметр("НачалаПериода", ДобавитьМесяц(пПериод, пЧислоМесяцев));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РаспределитьПоСегментам(пДата = Неопределено,Подразделение=Неопределено,Партнер=Неопределено) Экспорт
	
	Если пДата = Неопределено Тогда
		пДата = ТекущаяДата();
	КонецЕсли;
	
	/////////////////////////
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	сег_СегментацияКонтрагентовСрезПоследних.Подразделение,
	|	сег_СегментацияКонтрагентовСрезПоследних.Партнер,
	|	сег_СегментацияКонтрагентовСрезПоследних.ВидСегмента,
	|	сег_СегментацияКонтрагентовСрезПоследних.Сегмент
	|ИЗ
	|	РегистрСведений.сег_СегментацияКонтрагентов.СрезПоследних(&пДата, &УсловиеОтбора) КАК сег_СегментацияКонтрагентовСрезПоследних");
	Запрос.УстановитьПараметр("пДата", Новый Граница(НачалоДня(пДата), ВидГраницы.Исключая));
	
	//ASP. Если заполнены параметры частичного распеределения тогда проставляем соотвествующий признак
	ЧастичноеРаспредение=(Подразделение<>Неопределено И Партнер<>Неопределено);
	
	
	//ASP. Если используется частичное  распределение тогда подставляем параметры в отбор
	Если ЧастичноеРаспредение  Тогда
		МассивПодразделений=Новый Массив;
		МассивПодразделений.Добавить(Подразделение);
		МассивПодразделений.Добавить(Справочники.СтруктураПредприятия.ПустаяСсылка());

		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеОтбора", " Подразделение В (&МассивПодразделений) И Партнер=&Партнер ");
		Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
		Запрос.УстановитьПараметр("Партнер",Партнер);
		
	Иначе
		Запрос.УстановитьПараметр("УсловиеОтбора",Истина);
	КонецЕсли;
	
	тзСегментация = Запрос.Выполнить().Выгрузить();
	тзСегментация.Индексы.Добавить("Подразделение, Партнер, ВидСегмента");
	
	/////////////////////////
	НаборЗаписей = РегистрыСведений.сег_СегментацияКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(пДата);
	
	//ASP. Если выполняется частичный расчет, тогда устанавливаем отбор по параметрам расчета
	Если ЧастичноеРаспредение Тогда
		НаборЗаписей.Отбор.Партнер.Установить(Партнер);
	КонецЕсли;
	
	тзПодр = ПолучитьПодразделенияЗапросом(?(ЧастичноеРаспредение,МассивПодразделений,Неопределено));
	тзКонтрагенты = ПолучитьОбработкуЗаказовЗапросом(пДата, -12, тзПодр.ВыгрузитьКолонку("Подразделение"),?(ЧастичноеРаспредение,Партнер,Неопределено));
	
	Для Каждого стр Из тзПодр Цикл
		ОбработатьПравила(пДата, тзКонтрагенты, НаборЗаписей, стр.Подразделение);
	КонецЦикла;
	
	/////////////////////////
	сч = НаборЗаписей.Количество();
	отбор = Новый Структура("Подразделение, Партнер, ВидСегмента");
	Пока сч > 0 Цикл
		сч = сч-1;
		зап = НаборЗаписей[сч];
		ЗаполнитьЗначенияСвойств(отбор, зап);
		мас = тзСегментация.НайтиСтроки(отбор);
		
		//ASP. Если выполняется частичный расчет и подразделение не входит в массив расчитываемых, тогда убираем запись из набора
		НерасчитываемоеПодразделение= ?(ЧастичноеРаспредение,МассивПодразделений.Найти(зап.Подразделение)=Неопределено,Ложь);
		
		//ASP. Вынес в отдельную переменную для наглядности
		ИзмененийНет=мас.Количество() > 0 И мас[0].Сегмент = зап.Сегмент;
		
		Если ИзмененийНет Или НерасчитываемоеПодразделение  Тогда
			НаборЗаписей.Удалить(сч)
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецФункции

Процедура ап_ЗапуститьСегментацию() Экспорт
	
	РаспределитьПоСегментам();
	
КонецПроцедуры

Функция ОбработкаПравилаДилер(пЭлементКонтрагента, пНаборЗаписей, пДата) Экспорт
	
	лЗапись = пНаборЗаписей.Добавить();
	лЗапись.Период = пДата;
	лЗапись.Подразделение = пЭлементКонтрагента.Подразделение;
	лЗапись.Партнер = пЭлементКонтрагента.Партнер;
	лЗапись.ВидСегмента = Справочники.сег_Сегменты.ДилерскийСегмент;
	
	Если (пЭлементКонтрагента.сег_Дилер = Справочники.сег_Сегменты.Дилер) Тогда
		лЗапись.Сегмент = Справочники.сег_Сегменты.Дилер;
	Иначе
		лЗапись.Сегмент = Справочники.сег_Сегменты.НеДилер;
	КонецЕсли;	
	
КонецФункции

Функция ОбработкаПравилаМаркетинговый(пЭлементКонтрагента, пНаборЗаписей, пДата, тзНастройки) Экспорт
	
	лЗапись = пНаборЗаписей.Добавить();
	лЗапись.Период = пДата;
	лЗапись.Подразделение = пЭлементКонтрагента.Подразделение;
	лЗапись.Партнер = пЭлементКонтрагента.Партнер;
	лЗапись.ВидСегмента = Справочники.сег_Сегменты.МаркетинговыйСегмент;
	
	Если ЗначениеЗаполнено(пЭлементКонтрагента.ДатаПоследнегоЗаказа) Тогда
		лКоличествоДней = (НачалоДня(пДата) - НачалоДня(пЭлементКонтрагента.ДатаПоследнегоЗаказа)) / 86400;
	Иначе
		лКоличествоДней = 0;
	КонецЕсли;
	Если ЗначениеЗаполнено(пЭлементКонтрагента.ДатаПервогоЗаказа) Тогда
		лКоличествоДнейПервого = (НачалоДня(пДата) - НачалоДня(пЭлементКонтрагента.ДатаПервогоЗаказа)) / 86400;
	Иначе
		лКоличествоДнейПервого = 0;
	КонецЕсли;
	
	
	Для Каждого настр Из тзНастройки Цикл
		
		Если настр.Подразделение <> пЭлементКонтрагента.Подразделение Тогда Продолжить КонецЕсли;
		
		Если настр.Сегмент = Справочники.сег_Сегменты.ПервичныйКлиент Тогда
			Если настр.Показатель2 >= пЭлементКонтрагента.Заказ Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.НовыйКлиент Тогда
			Если настр.Показатель1 < пЭлементКонтрагента.Заказ И настр.Показатель2 >= пЭлементКонтрагента.Заказ Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.СтарыйКлиент Тогда
			Если настр.Показатель1 < пЭлементКонтрагента.Заказ И
				 настр.Показатель3 > пЭлементКонтрагента.ЗаказовЗаГод Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.ПостоянныйКлиент Тогда
			Если настр.Показатель1 < пЭлементКонтрагента.Заказ И
				 настр.Показатель3 <= пЭлементКонтрагента.ЗаказовЗаГод
				 И пЭлементКонтрагента.ЗаказовЗаГод > 1 Тогда
				
				лПоказатель4 = настр.Показатель4 / 100 + 1;
				лИнтервал = (лКоличествоДнейПервого - лКоличествоДней) / (пЭлементКонтрагента.ЗаказовЗаГод - 1);
				
				Если лИнтервал > 0 И лПоказатель4 > (лКоличествоДней / лИнтервал) Тогда
					лЗапись.Сегмент = настр.Сегмент;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.УснувшийКлиент Тогда
			Если настр.Показатель1 < пЭлементКонтрагента.Заказ И
				 настр.Показатель3 <= пЭлементКонтрагента.ЗаказовЗаГод
				 И пЭлементКонтрагента.ЗаказовЗаГод > 1 Тогда
				
				лПоказатель4 = настр.Показатель4 / 100 + 1;
				лИнтервал = (лКоличествоДнейПервого - лКоличествоДней) / (пЭлементКонтрагента.ЗаказовЗаГод - 1);
				
				Если (лИнтервал <= 0) ИЛИ (лИнтервал > 0 И лПоказатель4 <= (лКоличествоДней / лИнтервал)) Тогда
					лЗапись.Сегмент = настр.Сегмент;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(лЗапись.Сегмент) Тогда
		лЗапись.Сегмент = Справочники.сег_Сегменты.НеУказанМаркетинг
	КонецЕсли;
	
КонецФункции

Функция ОбработкаПравилаОбороты(пЭлементКонтрагента, пНаборЗаписей, пДата, тзНастройки) Экспорт
	
	лЗапись = пНаборЗаписей.Добавить();
	лЗапись.Период = пДата;
	лЗапись.Подразделение = пЭлементКонтрагента.Подразделение;
	лЗапись.Партнер = пЭлементКонтрагента.Партнер;
	лЗапись.ВидСегмента = Справочники.сег_Сегменты.ОборотныйСегмент;
	
	Если пЭлементКонтрагента.Заказ > пЭлементКонтрагента.ЗаказовЗаГод Тогда
		лКоличествоМесяцев = 12;
	ИначеЕсли ЗначениеЗаполнено(пЭлементКонтрагента.ДатаПервогоЗаказа) Тогда
		Месяц1 = Месяц(пЭлементКонтрагента.ДатаПервогоЗаказа);
		Месяц2 = Месяц(пДата);
		Если Месяц1 >= Месяц2 И НачалоГода(пЭлементКонтрагента.ДатаПервогоЗаказа) < НачалоГода(пДата) Тогда
			Месяц2 = Месяц2 + 12
		КонецЕсли;
		лКоличествоМесяцев = Месяц2 - Месяц1;
	Иначе
		лКоличествоМесяцев = 1;
	КонецЕсли;
	
	СредняяСумма = ?(ЗначениеЗаполнено(пЭлементКонтрагента.СуммаЗаГод), пЭлементКонтрагента.СуммаЗаГод, 0) / ?(лКоличествоМесяцев = 0, 1, лКоличествоМесяцев);
	
	Для Каждого настр Из тзНастройки Цикл
		
		Если настр.Подразделение <> пЭлементКонтрагента.Подразделение Тогда Продолжить КонецЕсли;
		
		Если настр.Сегмент = Справочники.сег_Сегменты.Маленький Тогда
			Если настр.Показатель2 >= СредняяСумма Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.ОченьБольшой Тогда
			Если настр.Показатель1 < СредняяСумма Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		Иначе
			Если настр.Показатель1 < СредняяСумма И настр.Показатель2 >= СредняяСумма Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(лЗапись.Сегмент) Тогда
		лЗапись.Сегмент = Справочники.сег_Сегменты.НеУказанОборотный
	КонецЕсли;
	
КонецФункции

Функция ОбработкаПравилаЧастотаЗаказов(пЭлементКонтрагента, пНаборЗаписей, пДата, тзНастройки) Экспорт
	
	лЗапись = пНаборЗаписей.Добавить();
	лЗапись.Период = пДата;
	лЗапись.Подразделение = пЭлементКонтрагента.Подразделение;
	лЗапись.Партнер = пЭлементКонтрагента.Партнер;
	лЗапись.ВидСегмента = Справочники.сег_Сегменты.СегментПоЧастотеЗаказов;
	
	Для Каждого настр Из тзНастройки Цикл
		
		Если настр.Подразделение <> пЭлементКонтрагента.Подразделение Тогда Продолжить КонецЕсли;
		
		Если настр.Сегмент = Справочники.сег_Сегменты.Редко Тогда
			Если настр.Показатель2 >= пЭлементКонтрагента.ЗаказовЗаГод Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		ИначеЕсли настр.Сегмент = Справочники.сег_Сегменты.ОченьЧасто Тогда
			Если настр.Показатель1 < пЭлементКонтрагента.ЗаказовЗаГод Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		Иначе
			Если настр.Показатель1 < пЭлементКонтрагента.ЗаказовЗаГод И настр.Показатель2 >= пЭлементКонтрагента.ЗаказовЗаГод Тогда
				лЗапись.Сегмент = настр.Сегмент;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(лЗапись.Сегмент) Тогда
		лЗапись.Сегмент = Справочники.сег_Сегменты.НеУказанПоЧастотеЗаказов
	КонецЕсли;
	
КонецФункции

Функция ОбработатьПравила(пДата, тзКонтрагенты, НаборЗаписей, пПодразделение) Экспорт
	
	ЗапПоказатели = Новый Запрос("ВЫБРАТЬ
	                             |	сег_ПоказателиСегментов.Сегмент,
	                             |	сег_ПоказателиСегментов.Подразделение,
	                             |	сег_ПоказателиСегментов.Показатель1,
	                             |	сег_ПоказателиСегментов.Показатель2,
	                             |	сег_ПоказателиСегментов.Показатель3,
	                             |	сег_ПоказателиСегментов.Показатель4
	                             //|ПОМЕСТИТЬ Маркетинговый0
	                             |ИЗ
	                             |	РегистрСведений.сег_ПоказателиСегментов КАК сег_ПоказателиСегментов
	                             |ГДЕ
	                             |	сег_ПоказателиСегментов.Сегмент.Родитель = ЗНАЧЕНИЕ(Справочник.сег_Сегменты.МаркетинговыйСегмент)
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	сег_ПоказателиСегментов.Сегмент,
	                             |	сег_ПоказателиСегментов.Подразделение,
	                             |	сег_ПоказателиСегментов.Показатель1,
	                             |	сег_ПоказателиСегментов.Показатель2,
	                             |	сег_ПоказателиСегментов.Показатель3,
	                             |	сег_ПоказателиСегментов.Показатель4
	                             //|ПОМЕСТИТЬ Оборотный1
	                             |ИЗ
	                             |	РегистрСведений.сег_ПоказателиСегментов КАК сег_ПоказателиСегментов
	                             |ГДЕ
	                             |	сег_ПоказателиСегментов.Сегмент.Родитель = ЗНАЧЕНИЕ(Справочник.сег_Сегменты.ОборотныйСегмент)
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	сег_ПоказателиСегментов.Сегмент,
	                             |	сег_ПоказателиСегментов.Подразделение,
	                             |	сег_ПоказателиСегментов.Показатель1,
	                             |	сег_ПоказателиСегментов.Показатель2,
	                             |	сег_ПоказателиСегментов.Показатель3,
	                             |	сег_ПоказателиСегментов.Показатель4
	                             //|ПОМЕСТИТЬ ПоЧастотеЗаказов2
	                             |ИЗ
	                             |	РегистрСведений.сег_ПоказателиСегментов КАК сег_ПоказателиСегментов
	                             |ГДЕ
	                             |	сег_ПоказателиСегментов.Сегмент.Родитель = ЗНАЧЕНИЕ(Справочник.сег_Сегменты.СегментПоЧастотеЗаказов)");
	РезЗапПоказатели = ЗапПоказатели.ВыполнитьПакет();					  
						  
						  
	Для Каждого Элемент Из тзКонтрагенты Цикл
		
		Если пПодразделение <> Элемент.Подразделение Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработкаПравилаДилер(Элемент, НаборЗаписей, пДата);
		
		ОбработкаПравилаМаркетинговый(Элемент, НаборЗаписей, пДата, РезЗапПоказатели[0].Выгрузить());
				
		ОбработкаПравилаОбороты(Элемент, НаборЗаписей, пДата, РезЗапПоказатели[1].Выгрузить());
		
		ОбработкаПравилаЧастотаЗаказов(Элемент, НаборЗаписей, пДата, РезЗапПоказатели[2].Выгрузить());
		
	КонецЦикла;
	
КонецФункции
